'use strict'

// 全局枚举对象
var Enum = {
  //部门类型
  DeptType: {
    1: "系统",
    2: "责任单位",
    3: "纪检组",
  },
  //账号状态
  AccountStatus: {
    1: "初始化",
    2: "正常",
    3: "冻结",
    4: "已删除",
    5: "黑名单",
  },
  // 用户类型
  UserType: {
    1: "操作员",
    2: "管理员",
    3: "审核人",
    4: "系统用户",
  },
  //审核状态
  ApproveStatus: {
    1: "待审核",
    2: "审核通过",
    3: "审核不通过",
  },
  // 当前工作状态
  JobStatus: {
    1: "在职",
    2: "退休",
    3: "调离",
    4: "离职",
  },
  // 处分亮灯
  PunishLamp: {
    1: "始终未受处分",
    2: "过了处分期",
    3: "处分期即将结束",
    4: "处分期",
  },
  //处分期限
  PunishTerm: {
    1: "暂无处分",
    2: "半年",
    3: "一年",
    4: "两年",
    5: "三年",
    6: "五年",
    7: "长期",
  },
  //性别
  Gender: {
    1: "男",
    2: "女",
    3: "未知",
  },
  // 年龄类型
  AgeType:{
    1: "30岁及以下",
    2: "31岁至40岁",
    3: "41岁至50岁",
    4: "51岁至60岁",
    5: "60岁及以上",
  },
  // 民族
  Nation: {
    1: "汉族",
    2: "阿昌族",
    3: "白族",
    4: "保安族",
    5: "布朗族",
    6: "布依族",
    7: "朝鲜族",
    8: "达斡尔族",
    9: "傣族",
    10: "德昂族",
    11: "东乡族",
    12: "侗族",
    13: "独龙族",
    14: "鄂伦春族",
    15: "俄罗斯族",
    16: "鄂温克族",
    17: "高山族",
    18: "仡佬族",
    19: "哈尼族",
    20: "哈萨克族",
    21: "赫哲族",
    22: "回族",
    23: "基诺族",
    24: "景颇族",
    25: "京族",
    26: "柯尔克孜族",
    27: "拉祜族",
    28: "傈僳族",
    29: "黎族",
    30: "珞巴族",
    31: "毛南族",
    32: "满族",
    33: "门巴族",
    34: "蒙古族",
    35: "苗族",
    36: "仫佬族",
    37: "纳西族",
    38: "怒族",
    39: "普米族",
    40: "羌族",
    41: "撒拉族",
    42: "畲族",
    43: "水族",
    44: "塔吉克族",
    45: "塔塔尔族",
    46: "土家族",
    47: "土族",
    48: "佤族",
    49: "维吾尔族",
    50: "乌孜别克族",
    51: "锡伯族",
    52: "瑶族",
    53: "彝族",
    54: "裕固族",
    55: "藏族",
    56: "壮族",
  },
  // 婚姻状况
  MaritalStatus: {
    1: "未婚",
    2: "已婚",
  },
  // 文化程度
  EduLevel: {
    1: "博士及以上",
    2: "硕士",
    3: "本科",
    4: "大专",
    5: "中专",
    6: "高中",
    7: "初中",
    8: "小学",
    9: "文盲",
    10: "半文盲",
  },
  // 政治面貌
  PolitOutlook: {
    1: "中共党员",
    2: "中共预备党员",
    2: "共青团员",
    3: "民革党员",
    4: "民盟盟员",
    5: "民建会员",
    6: "民进会员",
    7: "农工党党员",
    8: "致公党党员",
    9: "九三学社社员",
    10: "台盟盟员",
    11: "无党派人士",
    12: "群众",
  },
  //单位性质
  DeptProp: {
    1: "政府",
  },
  // 职级
  JobLevel: {
    1: "正厅级",
    2: "副厅级",
    3: "正处级",
    4: "副处级",
    5: "正科级",
    6: "副科级",
    7: "主任科员",
    8: "副主任科员",
    9: "科员",
    10: "其他",
  },
  // 全日制学历
FullEduLevel: {
    1: "博士及以上",
    2: "硕士",
    3: "本科",
    4: "大专",
    5: "中专",
    6: "高中",
    7: "初中",
    8: "小学",
  },
  // 全日制学历
JobEduLevel: {
    1: "博士及以上",
    2: "硕士",
    3: "本科",
    4: "大专",
    5: "中专",
    6: "高中",
    7: "初中",
    8: "小学",
  },
  // 家庭成员关系
FamilyRelation: {
    1: "爷爷",
    2: "奶奶",
    3: "父亲",
    4: "母亲",
    5: "哥哥",
    6: "姐姐",
    7: "弟弟",
    8: "妹妹",
    9: "儿子",
    10: "女儿",
    11: "孙子",
    12: "孙女",
  },

////////////////////////档案管理/////////////////////////
// 处分类型
  PunishType: {
    1: "通报",
    2: "诫勉",
    3: "组织处理",
    4: "党内警告",
    5: "党内严重警告",
    6: "撤销党内职务",
    7: "留党察看",
    8: "开除党籍",
    9: "警告",
    10: "记过",
    11: "记大过",
    12: "记大过",
    13: "撤职",
    14: "开除"
  },

  ////////////////////////年度考核/////////////////////////
  //考核等级
  AssessmentLevel: {
    1: "优秀",
    2: "称职",
    3: "基本称职",
    4: "不称职",
  },
  // 近三年考核等级
AssessmentNearly: {
    1:"三年优秀",
    2:"两年优秀",
    3:"一年优秀",
    4:"称职",
    5:"基本称职",
    6:"不称职",
    7:"未录入",
  },

////////////////////////约谈提醒/////////////////////////
// 谈话种类
 TalkType: {
    1:"约谈提醒",
    2:"批评教育",
    3:"责令检查",
    4:"诫勉谈话",
  },

// 报表类型
TableType: {
    1:"述廉报告民主测评",
    2:"生活会",
    3:"日常监督",
  },


  // SubjectType: {
  //   1: "个人",
  //   2: "单位",
  // },





  QuFrom: {
    1: "检举举报",
    2: "执纪监督和审查调查中发现",
    3: "巡视巡察中发现",
    4: "审计、司法、行政执法机关移送",
    5: "上级转办、交办、领导批办",
    6: "其他"
  },

  Violate: {
    1: "违反政治纪律",
    2: "违反组织纪律",
    3: "违反廉洁纪律",
    4: "违反群众纪律",
    5: "违反工作纪律",
    6: "违反生活纪律",
  },

  // 以下枚举值从Config接口动态取得
  // JobLevel: {},
}
