'use strict'

// 全局枚举对象
var Enum = {
  DeptType: {
    1: "纪委",
    2: "分组",
    3: "责任单位",
  },

  SubjectType: {
    1: "个人",
    2: "单位",
  },

  PolitOutlook: {
    1: "中共党员",
    2: "共青团员",
    3: "民革党员",
    4: "民盟盟员",
    5: "民建会员",
    6: "民进会员",
    7: "农工党党员",
    8: "致公党党员",
    9: "九三学社社员",
    10: "台盟盟员",
    11: "无党派人士",
    12: "群众",
  },

  Gender: {
    1: "男",
    2: "女",
    3: "未知",
  },

  QuFrom: {
    1: "检举举报",
    2: "执纪监督和审查调查中发现",
    3: "巡视巡察中发现",
    4: "审计、司法、行政执法机关移送",
    5: "上级转办、交办、领导批办",
    6: "其他"
  },

  Violate: {
    1: "违反政治纪律",
    2: "违反组织纪律",
    3: "违反廉洁纪律",
    4: "违反群众纪律",
    5: "违反工作纪律",
    6: "违反生活纪律",
  },

  // 以下枚举值从Config接口动态取得
  JobLevel: {},
  EduLevel: {},
}